# Data Cleaning

In [147]:
import pandas as pd

# Brisbane data for 2017 to 2019
bri_19 = pd.DataFrame(pd.read_csv("../project-3/data/brisbane/brisbane-mk4_2019-01-01t00_00-2019-06-30t23_30.csv"))
bri_18 = pd.DataFrame(pd.read_csv("../project-3/data/brisbane/brisbane-mk4_2018-01-01t00_00-2018-12-31t23_00.csv"))
bri_17 = pd.DataFrame(pd.read_csv("../project-3/data/brisbane/brisbane-mk42017-01-01t0000-2017-12-31t2330.csv"))

# Goald Coast data for 2017 to 2019
gol_19 = pd.DataFrame(pd.read_csv("../project-3/data/gold-coast/gold-coast_verifieddata.csv"))
gol_18 = pd.DataFrame(pd.read_csv("../project-3/data/gold-coast/gold-coast_2018-01-01t00_00-2018-12-31t23_30.csv"))
gol_17 = pd.DataFrame(pd.read_csv("../project-3/data/gold-coast/gold-coast_2017-01-01t00_00-2017-12-31t23_30.csv"))

# Townville data for 2017 to 2019
tow_19 = pd.DataFrame(pd.read_csv("../project-3/data/townsville/townsville_verifieddata.csv"))
tow_18 = pd.DataFrame(pd.read_csv("../project-3/data/townsville/townsville_2018-01-01t00_00-2018-12-31t23_30.csv"))
tow_17 = pd.DataFrame(pd.read_csv("../project-3/data/townsville/townsville_2017-01-01t00_00-2017-12-31t23_30.csv"))

# List of the files on use
file_list = [[bri_19, bri_18, bri_17], [gol_19, gol_18, gol_17], [tow_19, tow_18, tow_17]]

In [161]:
# Date type
bri_19["Date/Time"] = pd.to_datetime(bri_19["Date/Time"])
bri_19["Date/Time"] = bri_19["Date/Time"].dt.date

bri_18["Date/Time"] = pd.to_datetime(bri_18["Date/Time"])
bri_18["Date/Time"] = bri_18["Date/Time"].dt.date

bri_17["Date/Time"] = pd.to_datetime(bri_17["Date/Time"])
bri_17["Date/Time"] = bri_17["Date/Time"].dt.date

gol_19["Date/Time"] = pd.to_datetime(gol_19["Date/Time"])
gol_19["Date/Time"] = gol_19["Date/Time"].dt.date

gol_18["Date/Time"] = pd.to_datetime(gol_18["Date/Time"])
gol_18["Date/Time"] = gol_18["Date/Time"].dt.date

gol_17["Date/Time"] = pd.to_datetime(gol_17["Date/Time"])
gol_17["Date/Time"] = gol_17["Date/Time"].dt.date

tow_19["Date/Time"] = pd.to_datetime(tow_19["Date/Time"])
tow_19["Date/Time"] = tow_19["Date/Time"].dt.date

tow_18["Date/Time"] = pd.to_datetime(tow_18["Date/Time"])
tow_18["Date/Time"] = tow_18["Date/Time"].dt.date

tow_17["Date/Time"] = pd.to_datetime(tow_17["Date/Time"])
tow_17["Date/Time"] = tow_17["Date/Time"].dt.date

# Dics with new columns info
location_bri = {"Location": "Brisbane", "Longitude": "153.021072", "Latitude": "-27.470125"}
location_gol = {"Location": "Gold Coast", "Longitude": "153.399994", "Latitude": "-28.016666"}
location_tow = {"Location": "Townsville", "Longitude": "146.816956", "Latitude": "-19.258965"}

# Create one unique DataFrame for each location
bri = pd.concat(file_list[0])
gol = pd.concat(file_list[1])
tow = pd.concat(file_list[2])

# Unify date types before concat
pd.to_datetime(bri["Date/Time"])
pd.to_datetime(gol["Date/Time"])
pd.to_datetime(tow["Date/Time"])

# Add location column to each DataFrame.
    # 1. Brisbane
bri["Location"] = location_bri["Location"]
bri["Longitude"] = location_bri["Longitude"]
bri["Latitude"] = location_bri["Latitude"]

    # 2. Gold Coast
gol["Location"] = location_gol["Location"]
gol["Longitude"] = location_gol["Longitude"]
gol["Latitude"] = location_gol["Latitude"]

    # 3. Townville
tow["Location"] = location_tow["Location"]
tow["Longitude"] = location_tow["Longitude"]
tow["Latitude"] = location_tow["Latitude"]

# Create a DataFrame combining all locations
aus = pd.concat([bri, gol, tow]).reset_index(drop=True)

In [149]:
bri_19.head()

    Date/Time     Hs   Hmax     Tz    Tp  Peak Direction    SST
0  2019-01-01  1.331  2.275  5.816  8.69           78.91  25.99
1  2019-01-01  1.361  2.414  5.955  8.69           80.23  25.99
2  2019-01-01  1.545  2.984  6.216  8.69           77.06  25.94
3  2019-01-01  1.485  2.161  6.159  9.09           80.41  25.94
4  2019-01-01  1.504  2.894  6.056  8.69           80.76  25.94

In [150]:
bri_18.head()

    Date/Time     Hs   Hmax     Tz    Tp  Peak Direction    SST
0  2018-01-01  0.942  1.454  4.905  5.88          175.63  25.05
1  2018-01-01  0.948  1.576  5.017  5.71          177.74  24.91
2  2018-01-01  0.953  1.682  5.198  5.55          178.44  24.87
3  2018-01-01  0.915  1.947  5.406  5.55          174.75  24.87
4  2018-01-01  0.930  1.723  5.278  5.71          173.69  24.73

In [151]:
bri_17.head()

    Date/Time     Hs   Hmax     Tp     Tz  Peak Direction    SST
0  2017-01-01  1.308  2.059  4.878  4.200           30.68  26.08
1  2017-01-01  1.319  2.159  5.263  4.375           28.65  25.99
2  2017-01-01  1.216  1.852  4.651  4.288           26.54  25.99
3  2017-01-01  1.182  1.940  4.762  4.155           30.15  25.89
4  2017-01-01  1.188  1.836  5.000  4.180           31.73  25.89

In [152]:
gol_19.head()

    Date/Time     Hs  Hmax     Tz     Tp  Peak Direction   SST
0  2019-01-01  1.219  2.07  5.995  8.872           78.09 -99.9
1  2019-01-01  1.270  2.24  5.905  8.827           78.09 -99.9
2  2019-01-01  1.225  2.01  5.594  8.407           79.09 -99.9
3  2019-01-01  1.218  2.00  5.781  8.891           78.09 -99.9
4  2019-01-01  1.156  1.85  5.429  8.224           77.09 -99.9

In [153]:
gol_18.head()

    Date/Time     Hs  Hmax     Tz     Tp  Peak Direction    SST
0  2018-01-01  0.631  1.36  4.768  9.312           79.11  24.55
1  2018-01-01  0.626  1.02  4.749  6.737          105.11  24.55
2  2018-01-01  0.604  1.02  4.632  5.676          102.11  24.60
3  2018-01-01  0.652  1.13  4.959  6.182          129.11  24.55
4  2018-01-01  0.635  0.91  4.772  6.161          113.11  24.55

In [154]:
gol_17.head()

    Date/Time     Hs  Hmax     Tz     Tp  Peak Direction    SST
0  2017-01-01  1.015  1.88  5.010  5.513           57.12  21.85
1  2017-01-01  1.003  1.62  4.904  7.501           63.12  21.75
2  2017-01-01  0.939  1.73  4.867  5.462           63.12  21.75
3  2017-01-01  0.976  1.81  4.980  7.279           60.12  21.70
4  2017-01-01  0.949  1.82  4.888  5.428           75.12  21.95

In [155]:
tow_19.head()

    Date/Time     Hs  Hmax     Tz     Tp  Peak Direction    SST
0  2019-01-01  1.181  1.95  4.161  5.490           91.43  27.90
1  2019-01-01  1.184  2.07  4.224  4.405           87.43  27.85
2  2019-01-01  1.162  2.21  4.312  4.046          102.43  27.85
3  2019-01-01  1.162  2.19  4.121  4.688           88.43  27.85
4  2019-01-01  1.134  1.91  4.277  5.796           78.43  27.85

In [156]:
tow_18.head()

    Date/Time      Hs   Hmax      Tz      Tp  Peak Direction    SST
0  2018-01-01 -99.900 -99.90 -99.900 -99.900          -99.90 -99.90
1  2018-01-01   0.561   1.08   3.172   3.798          -99.90 -99.90
2  2018-01-01   0.572   0.99   3.135   3.827           12.46  29.95
3  2018-01-01   0.613   1.02   3.256   3.799           22.46  29.95
4  2018-01-01   0.609   0.99   3.236   3.953            5.46  29.95

In [157]:
tow_17.head()

    Date/Time      Hs   Hmax      Tz      Tp  Peak Direction    SST
0  2017-01-01 -99.900 -99.90 -99.900 -99.900          -99.90 -99.90
1  2017-01-01   0.514   1.17   3.390   3.757          -99.90 -99.90
2  2017-01-01   0.488   0.88   3.356   3.647           42.48  29.25
3  2017-01-01   0.517   0.94   3.323   3.441           29.48  29.20
4  2017-01-01   0.495   0.97   3.526   3.885           35.48  29.20

In [162]:
aus.head()

,Date/Time,Hs,Hmax,Tz,Tp,Peak Direction,SST,Location,Longitude,Latitude
0,2019-01-01,1.331,2.275,5.816,8.69,78.91,25.99,Brisbane,153.021072,-27.470125
1,2019-01-01,1.361,2.414,5.955,8.69,80.23,25.99,Brisbane,153.021072,-27.470125
2,2019-01-01,1.545,2.984,6.216,8.69,77.06,25.94,Brisbane,153.021072,-27.470125
3,2019-01-01,1.485,2.161,6.159,9.09,80.41,25.94,Brisbane,153.021072,-27.470125
4,2019-01-01,1.504,2.894,6.056,8.69,80.76,25.94,Brisbane,153.021072,-27.470125

## Export the file as .csv

In [163]:
# Export it as .csv
aus.to_csv("../project-3/data/waves_queensland.csv", sep=",")

In [164]:
#Â Export as separate files
bri.to_csv("../project-3/data/brisbane.csv", sep=",")
gol.to_csv("../project-3/data/gold-coast.csv", sep=",")
tow.to_csv("../project-3/data/townville.csv", sep=",")